package com.digdes.crp.javacoretasks.chapter5;


public class Exercise9 {
    /** Методы из классов Scanner и PrintWriter не генерируют
    проверяемые исключения, чтобы ими легче было пользоваться начинающим программировать на
    Java. Как же тогда выяснить, произошли ли ошибки в процессе чтения или
    записи данных? Следует иметь в виду, что конструкторы могут генерировать
    исключения. Почему это способно лишить всякого смысла цель упрощения
    классов для начинающих программировать на Java?

    Решение: как раз таки за счет генерирования исключений в конструкторе выявляются
    ошибки в процессе чтения или записи данных. Из-за этого новичкам всё равно приходится сталкиваться
    с исключениями. Однако, подсказки intellij idea помогут автоматически сгенерировать исключения
    или даже блоки try/catch, что может существенно помощь программирующему.**/

    public static void main(String[] args) {

    }
}
