package com.digdes.crp.javacoretasks.chapter7;

import java.util.*;

public class Exercise5 {
    /** Реализуйте метод public static void swap(List<?> list, int i, int j),
    выполняющий перестановку элементов обычным образом, когда класс,
    определяющий тип параметра list, реализует интерфейс RandomAccess, а иначе
    сводящий к минимуму обход элементов на позициях, обозначаемых индексами i и j. **/

    public static void swap(List<?> list, int i, int j){
//        if(list instanceof RandomAccess){
//            Collections.swap(list, i, j);
//            System.out.println(list);
//        }
//        else {
//            Collections.binarySearch()
//
//        }
//
//        Map<String, Set<Integer>> s =
//        }


    }
}
