package com.digdes.crp.javacoretasks.chapter7;

import java.io.IOException;
import java.nio.file.Paths;
import java.util.*;

public class Exercise12 {
    /** Используя метод Collections.shuffle(), напишите программу для чтения
    предложения, перетасовки его слов и вывода результата. Устраните (до и после
    перетасовки) написание начального слова с заглавной буквы и наличие точки в
    конце предложения. Подсказка: не перетасовывайте при этом слова  **/

    public static void main(String[] args) {
//        Scanner scanner = new Scanner(Paths.get("C:\\Users\\Strelets.A\\Desktop\\qwe.txt"));
//        List<String> stringList = new ArrayList<>();
//        while(scanner.hasNext())
//        {
//            String s = scanner.next();
//            stringList.add(s);
//        }
//        if( == "."){
//            stringList.remove(stringList.size()-1);
//        }
//        stringList.set(0, stringList.get(0).toLowerCase());
//        Collections.shuffle(stringList.subList(1, stringList.size()-1));
//        stringList.set(0, stringList.get(0).toLowerCase());
//        System.out.println(stringList);
    }
}
