package main.java.ru.furiosaming.javacoretasks.chapter7;

public class Exercise3 {
    public static void main(String[] args){
        System.out.println("Как вычислить объединение, пересечение и разность двух множеств, используя\n" +
                "//        только методы из интерфейса Set, но не организуя циклы?\n" +
                "//        Ответ: пересечение можно вычислить методом retainAll\u200B()\n" +
                "//        Сохраняет в этом наборе только те элементы, которые содержатся в указанной коллекции\n" +
                "//        Разность с помощью метода removeAll\u200B(Collection<?> c)\n" +
                "//        Он удаляет из этого набора все его элементы, содержащиеся в указанной коллекции\n" +
                "//        Для объединения метод addAll\u200B(Collection<? extends E> c)\n" +
                "//        Он добавляет все элементы в указанной коллекции в этот набор, если они еще не присутствуют");
    }
}
