package com.digdes.crp.javacoretasks.chapter2;

public class Exercise14 {
    /** Скомпилируйте класс Network , представленный в этой главе.
    Обратите внимание на то, что файл внутреннего класса называется
    Network$Member.class. Воспользуйтесь утилитой ja v a p ,
    чтобы исследовать сгенерированный код. Так, по следующей команде:
    javap - p r i v a t e имяКласса
    выводятся методы и переменные экземпляра. Выявите среди выводимых
    результатов ссылку на объемлющий класс. (В Linux и Mac OS X перед знаком $
    в имени класса следует указать знак \ при выполнении утилиты ja v a p . **/

    public static void main(String[] args) {

    }
}
